In [13]:
import glob
import numpy as np
import pandas as pd

In [ ]:
# 测试正则

In [2]:
allFiles = glob.glob(r'..\data\201*-baby-names-illinois.csv')
allFiles

['..\\data\\2014-baby-names-illinois.csv',
 '..\\data\\2015-baby-names-illinois.csv']

In [17]:
import re
pattern = re.compile('(\d+)-')
df_list = []
for file in allFiles:
    df = pd.read_csv(file, index_col=None, header = 0)
    # df中没有year信息,因此要添加year信息
    # 这里通过extract的方法从文件名中提取
    result = pattern.findall(file)
    df['year'] = result[0]
    df_list.append(df)
df_list

[     rank       name  frequency   sex  year
 0       1       Noah        837  Male  2014
 1       2  Alexander        747  Male  2014
 2       3    William        687  Male  2014
 3       4    Michael        680  Male  2014
 4       5       Liam        670  Male  2014
 ..    ...        ...        ...   ...   ...
 96     97        Max        170  Male  2014
 97     98      Brody        168  Male  2014
 98     99     Jaxson        168  Male  2014
 99    100     George        166  Male  2014
 100   101   Theodore        166  Male  2014

 [101 rows x 5 columns],
     rank       name  frequency   sex  year
 0      1       Noah        863  Male  2015
 1      2       Liam        709  Male  2015
 2      3  Alexander        703  Male  2015
 3      4      Jacob        650  Male  2015
 4      5    William        618  Male  2015
 ..   ...        ...        ...   ...   ...
 95    96   Giovanni        168  Male  2015
 96    97     Hudson        167  Male  2015
 97    98     Camden        165  Male  2015
 98    99        Max        164  Male  2015
 99   100    Maxwell        155  Male  2015

 [100 rows x 5 columns]]

In [18]:
new_df = pd.concat(df_list, axis=0)
new_df

    rank       name  frequency   sex  year
0      1       Noah        837  Male  2014
1      2  Alexander        747  Male  2014
2      3    William        687  Male  2014
3      4    Michael        680  Male  2014
4      5       Liam        670  Male  2014
..   ...        ...        ...   ...   ...
95    96   Giovanni        168  Male  2015
96    97     Hudson        167  Male  2015
97    98     Camden        165  Male  2015
98    99        Max        164  Male  2015
99   100    Maxwell        155  Male  2015

[201 rows x 5 columns]

In [7]:
str.extract()

AttributeError: type object 'str' has no attribute 'extract'